Hi @jbardin,

Thanks for your comment. Unfortunately I do believe this is an unintentional breakage caused by supporting depends_on for modules.

When I add an explicit depends_on field on the module then I see the same behaviour as terraform 0.12 respected. Also, the data source explicitly states that it will be read on apply as it refers to values not known.

Config modification:
```
resource "google_compute_network" "network" {
  name = "vpc-network"
  project = "foo"
}

module "foo" {
  source = "./module"
  network = google_compute_network.network.name
  project = google_compute_network.network.project
  depends_on = [google_compute_network.network] # Added this line.
}
```

Plan:
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "vpc-network"
      + project                         = "foo"
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # module.foo.data.google_compute_network.network will be read during apply
  # (config refers to values not yet known)
 <= data "google_compute_network" "network"  {
      + description            = (known after apply)
      + gateway_ipv4           = (known after apply)
      + id                     = (known after apply)
      + name                   = "vpc-network"
      + project                = "foo"
      + self_link              = (known after apply)
      + subnetworks_self_links = (known after apply)
    }

  # module.foo.google_service_networking_connection.private_vpc_connection will be created
  + resource "google_service_networking_connection" "private_vpc_connection" {
      + id                      = (known after apply)
      + network                 = (known after apply)
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "abc",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```